from rest_framework.pagination import PageNumberPagination


class CategoryPagination(PageNumberPagination):
    page_size = 10
    page_size_query_param = 'page_size'
    max_page_size = 100


class NoPagination(PageNumberPagination):
    page_size = None


POSITION_CHOICES = (
    ('1', 'Позиция 1'),
    ('2', 'Позиция 2'),
    ('3', 'Позиция 3'),
)


STATUS_CHOICES = (
    ('Популярные', 'Популярные'),
    ('Недвижимость', 'Недвижимость'),
    ('Раскошный отдых', 'Раскошный отдых'),
    ('Продукты', 'Продукты'),
    ('Интервью', 'Интервью'),
    ('Предложение от компании', 'Предложение от компании'),
    ("Маектешуу", "Маектешуу"),
    ("Компаниядан сунуштар","Компаниядан сунуштар"),
    ("Люкс майрам", "Люкс майрам"),
    ("Кыймылсыз мулк", "Кыймылсыз мулк"),
    ("Популярдуу", "Популярдуу"),
    ("Продукттар", 'Продукттар'),
)

BANNER_CHOICES = (
    ('Главное', 'Главное'),
    ('Популярные', 'Популярные'),
    ('Недвижимость', 'Недвижимость'),
    ('Раскошный отдых', 'Раскошный отдых'),
    ('Продукты', 'Продукты'),
    ('Интервью', 'Интервью'),
    ('Предложение от компании', 'Предложение от компании'),
    ('Башкы', 'Башкы'),
    ("Маектешуу", "Маектешуу"),
    ("Компаниядан сунуштар","Компаниядан сунуштар"),
    ("Люкс майрам", "Люкс майрам"),
    ("Кыймылсыз мулк", "Кыймылсыз мулк"),
    ("Популярдуу", "Популярдуу"),
    ("Продукттар", 'Продукттар'),
)

RATATION_CHOICES = (
    ('1', 'Ротация 1'),
    ('2', 'Ротация 2'),
    ('3', 'Ротация 3'),
    ('4', 'Ротация 4'),
    ('5', 'Ротация 5')
)